cases/cfd_fixed_cylinder_re7622/0/k
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

kInlet          0.1;

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1.4415e-05;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 1.4415e-05;
    }

    outlet
    {
        type            zeroGradient;
    }

    upper
    {
        type            symmetryPlane;
    }

    lower
    {
        type            symmetryPlane;
    }

    cylinder
    {
        type            kqRWallFunction;
        value           uniform 1.4415e-05;
    }

    front
    {
        type            empty;
    }

    back
    {
        type            empty;
    }
}

// ************************************************************************* //
