cases/cfd_fixed_cylinder_re7622/0/p
/*--------------------------------*- C++ -*----------------------------------*\
  Initial kinematic pressure for the structured O-grid setup.
  The outlet reference fixes the pressure gauge; do not change it together
  with force-coefficient definitions without a new validation contract.
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p;
}

dimensions      [0 2 -2 0 0 0 0];
internalField   uniform 0;

boundaryField
{
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
    lower
    {
        type            symmetryPlane;
    }
    upper
    {
        type            symmetryPlane;
    }
    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            fixedValue;
        value           uniform 0;
    }
    cylinder
    {
        type            zeroGradient;
    }
}

// ************************************************************************* //
