cases/cfd_fixed_cylinder_re7622/0/yPlus
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  10
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      yPlus;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    front
    {
        type            empty;
    }
    cylinder
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0.05691184878
0.05691184879
0.05691184877
0.05691184873
0.05691184877
0.05691184882
0.05691184879
0.0569118488
...
)
;
    }
    back
    {
        type            empty;
    }
    inlet
    {
        type            calculated;
        value           uniform 0;
    }
    upper
    {
        type            symmetryPlane;
    }
    lower
    {
        type            symmetryPlane;
    }
    outlet
    {
        type            calculated;
        value           uniform 0;
    }
}


// ************************************************************************* //
