cases/cfd_fixed_cylinder_re7622/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  Momentum      | OpenFOAM: The CFD Toolbox
\*---------------------------------------------------------------------------*/
// Laminar incompressible model matching the current production fluid setup.
// Changing simulationType changes the physical/numerical model and requires
// a new validation contract.
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}

simulationType  RAS;

RAS
{
    model               kOmegaSST;

    turbulence          on;
    printCoeffs         on;
}